Revit 2027 API
AnalysisResultSchema.Scale Property
 Multiplier used for displaying diagram or vector values in view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
public:
property double Scale {
	double get ();
	void set (double value);
}
member Scale : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: scale is zero or negative
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace